//$INTRDR  JOB SYST,'CREAT PDS INIT',REGION=0M,
//     CLASS=D,MSGCLASS=X,NOTIFY=&SYSUID
//*---------------------------------------------------------------------
//*
//*
//* CONSTRUCTION ENVIRONNEMENT PRISE D'IMAGE
//*
//*
//*---------------------------------------------------------------------
//LANCEUR  EXEC  PGM=IEBGENER
//SYSUT1   DD  DSN=MSOL.INIT.INTRDR,DISP=SHR
//SYSUT2   DD  SYSOUT=(A,INTRDR)
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  DUMMY
